/******************************************************************************/
/*                                                                            */
/* src/lib/libc/stdio/snprintf.c                                              */
/*                                                                 2019/04/16 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdarg.h>
#include <stddef.h>
#include <stdio.h>


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       snprintf
 * @details     書式文字列formatとこれに続く可変長引数に従い文字数n分の文字列を
 *              sに書き込む。
 *
 * @param[out]  *s      文字列
 * @param[in]   n       文字数
 * @param[in]   *format 書式文字列
 * @param[in]   ...     可変長引数
 *
 * @return      文字数
 *
 * @note        null文字はカウントされない。
 */
/******************************************************************************/
int snprintf( char       *s,
              size_t     n,
              const char *format,
              ...                 )
{
    int     ret;    /* 戻り値           */
    va_list vaList; /* 可変長引数リスト */

    /* 初期化 */
    ret = 0;
    va_start( vaList, format );

    /* 書式変換 */
    ret = vsnprintf( s, n, format, vaList );

    va_end( vaList );

    return ret;
}


/******************************************************************************/
