/******************************************************************************/
/*                                                                            */
/* src/lib/libc/stdio/vsnprintf.c                                             */
/*                                                                 2019/04/10 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdarg.h>
#include <stddef.h>
#include <stdint.h>

/* モジュールヘッダ　*/
#include "Convert.h"


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       vsnprintf
 * @details     書式文字列formatと可変長引数リストargに従い文字数n分の文字列を
 *              sに書き込む。
 *
 * @param[out]  *s      文字列
 * @param[in]   n       文字数
 * @param[in]   *format 書式文字列
 * @param[in]   arg     可変長引数リスト
 *
 * @return      文字数
 *
 * @note        null文字はカウントされない。
 */
/******************************************************************************/
int vsnprintf( char       *s,
               size_t     n,
               const char *format,
               va_list    arg      )
{
    int readIdx;    /* 読込みインデックス */
    int writeIdx;   /* 書込みインデックス */

    /* 初期化 */
    readIdx  = 0;
    writeIdx = 0;

    /* 1文字毎に繰り返す */
    while ( writeIdx < n ) {
        /* 文字判定 */
        if ( format[ readIdx ] == '%' ) {
            /* 変換指定子 */

            readIdx++;
            Convert( s, n, format, &arg, &readIdx, &writeIdx );

        } else if ( format[ readIdx ] == '\0' ) {
            /* null文字 */

            s[ writeIdx ] = '\0';

            break;

        } else {
            /* その他 */

            s[ writeIdx++ ] = format[ readIdx++ ];
        }
    }

    return writeIdx;
}


/******************************************************************************/
